In [428]:
import pandas as pd
import matplotlib.pyplot as plt 
import numpy as np

In [429]:
dataset = pd.read_csv('../Data_Raw/train.csv')

In [430]:
dataset.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
1,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13 km/kg,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
2,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,3.50

In [431]:
dataset.shape

(5847, 14)

#### a.Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task.

In [432]:
print(dataset.isnull().sum())

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [433]:
dataset['Mileage'] = dataset['Mileage'].str.replace(r'\D', '', regex=True)
dataset['Mileage'] = pd.to_numeric(dataset['Mileage'], errors='coerce')
dataset['Mileage'].fillna(dataset['Mileage'].mean(), inplace=True)

In [434]:
dataset['Power'] = dataset['Power'].str.replace(r'\D', '', regex=True)
dataset['Power'] = pd.to_numeric(dataset['Power'], errors='coerce')
dataset['Power'].fillna(dataset['Power'].mean(), inplace=True)

In [435]:
dataset['Engine'] = dataset['Engine'].str.replace(r'\D', '', regex=True)
dataset['Engine'] = pd.to_numeric(dataset['Engine'], errors='coerce')
dataset['Engine'].fillna(dataset['Engine'].mean(), inplace=True)

In [436]:
dataset['Seats'].fillna(dataset['Seats'].mean(), inplace=True)

In [437]:
dataset.drop(columns=['New_Price'], inplace=True)
print(dataset.isnull().sum())

Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
dtype: int64

### Justification:
##### i. The key features of a used car are included in the columns "Mileage," "Power," "Seats," and "Engine." When estimating an automobile's cost, condition, and performance, these characteristics tend to be crucial.
##### ii. Removing these columns would make your dataset less dimensional. Additionally, these columns can improve how comprehensible your analysis is.
##### iii.New cost  Elevated Missing Values The "New Price" data may not be current or of high quality, which could introduce noise or mistakes into our study even if you were to impute missing values.

#### b.Remove the units from some of the attributes and only keep the numerical values (forexample remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from“New_price”).

In [438]:
dataset.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,1967.0,1582.0,1262.0,5.0,12.50
1,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13.0,1199.0,887.0,5.0,4.50
2,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,2077.0,1248.0,8876.0,7.0,6.00
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,152.0,1968.0,1408.0,5.0,17.74
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,2308.0,1461.0,631.0,5.0,3.50

##### In addressing question 'a' concerning missing values, it became imperative to first ensure that the dataset's numeric attributes were appropriately formatted. Hence, in tackling question 'b', the units were removed from relevant attributes like "Mileage", "Engine", "Power", and "New_price", thereby converting them into purely numeric values. This preprocessing step not only facilitated the analysis of missing values but also ensured uniformity in the dataset's numerical representation. Consequently, by resolving question 'b' beforehand, the subsequent task of identifying and handling missing values in question 'a' was conducted on a dataset with standardized numeric attributes, enabling more straightforward imputation or removal decisions based on the nature and distribution of missing data across the dataset.

#### c. Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.

In [439]:
dataset = pd.get_dummies(dataset, columns=['Fuel_Type', 'Transmission'], drop_first=True)
dataset.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,First,1967.0,1582.0,1262.0,5.0,12.50,0,0,1
1,2,Honda Jazz V,Chennai,2011,46000,First,13.0,1199.0,887.0,5.0,4.50,0,1,1
2,3,Maruti Ertiga VDI,Chennai,2012,87000,First,2077.0,1248.0,8876.0,7.0,6.00,0,0,1
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Second,152.0,1968.0,1408.0,5.0,17.74,0,0,0
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,First,2308.0,1461.0,631.0,5.0,3.50,0,0,1

#### d. Create one more feature and add this column to the dataset (you can use mutate function inR for this). For example, you can calculate the current age of the car by subtracting “Year” value from the current year.

In [440]:
dataset['Kilometers_Per_Year'] = dataset['Kilometers_Driven'] / (2024 - dataset['Year'])
dataset.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,First,1967.0,1582.0,1262.0,5.0,12.50,0,0,1,4555.555556
1,2,Honda Jazz V,Chennai,2011,46000,First,13.0,1199.0,887.0,5.0,4.50,0,1,1,3538.461538
2,3,Maruti Ertiga VDI,Chennai,2012,87000,First,2077.0,1248.0,8876.0,7.0,6.00,0,0,1,7250.000000
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Second,152.0,1968.0,1408.0,5.0,17.74,0,0,0,3697.272727
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,First,2308.0,1461.0,631.0,5.0,3.50,0,0,1,7909.000000

In [441]:
dataset_clean = dataset.to_csv("../Data_Clean/clean.csv", index=False)

#### e. Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset.

In [442]:
dataset.columns

Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'Price',
       'Fuel_Type_Electric', 'Fuel_Type_Petrol', 'Transmission_Manual',
       'Kilometers_Per_Year'],
      dtype='object')

In [443]:
selected_col = dataset[[ 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'Price', 'Fuel_Type_Electric', 'Fuel_Type_Petrol', 'Transmission_Manual', 'Kilometers_Per_Year']]
selected_col

,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year
0,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,First,1967.0,1582.0,1262.0,5.0,12.50,0,0,1,4555.555556
1,Honda Jazz V,Chennai,2011,46000,First,13.0,1199.0,887.0,5.0,4.50,0,1,1,3538.461538
2,Maruti Ertiga VDI,Chennai,2012,87000,First,2077.0,1248.0,8876.0,7.0,6.00,0,0,1,7250.000000
3,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Second,152.0,1968.0,1408.0,5.0,17.74,0,0,0,3697.272727
4,Nissan Micra Diesel XV,Jaipur,2013,86999,First,2308.0,1461.0,631.0,5.0,3.50,0,0,1,7909.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5842,Maruti Swift VDI,Delhi,2014,27365,First,284.0,1248.0,74.0,5.0,4.75,0,0,1,2736.500000
5843,Hyundai Xcent 1.1 CRDi S,Jaipur,2015,100000,First,244.0,1120.0,71.0,5.0,4.00,0,0,1,11111.111111
5844,Mahindra Xylo D4 BSIV,Jaipur,2012,55000,Second,140.0,2498.0,112.0,8.0,2.90,0,0,1,4583.333333
5845,Maruti Wagon R VXI,Kolkata,2013,46000,First,189.0,998.0,671.0,5.0,2.65,0,1,1,4181.818182
5846,Chevrolet Beat Diesel,Hyderabad,2011,47000,First,2544.0,936.0,576.0,5.0,2.50,0,0,1,3615.384615

In [444]:
filter = dataset[dataset['Fuel_Type_Petrol'] == 1]
filter

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year
1,2,Honda Jazz V,Chennai,2011,46000,First,13.0,1199.0,887.0,5.0,4.50,0,1,1,3538.461538
8,10,Maruti Ciaz Zeta,Kochi,2018,25692,First,2156.0,1462.0,10325.0,5.0,9.95,0,1,1,4282.000000
9,11,Honda City 1.5 V AT Sunroof,Kolkata,2012,60000,First,168.0,1497.0,1163.0,5.0,4.49,0,1,0,5000.000000
20,22,Audi A6 2011-2015 35 TFSI Technology,Mumbai,2015,55985,First,1353.0,1984.0,17701.0,5.0,23.50,0,1,0,6220.555556
21,23,Hyundai i20 1.2 Magna,Kolkata,2010,45807,First,185.0,1197.0,80.0,5.0,1.87,0,1,1,3271.928571
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5832,6004,Hyundai Getz GLE,Coimbatore,2007,66800,First,153.0,1341.0,83.0,5.0,2.20,0,1,1,3929.411765
5837,6009,Toyota Camry Hybrid,Mumbai,2015,33500,First,1916.0,2494.0,1582.0,5.0,19.75,0,1,0,3722.222222
5838,6010,Honda Brio 1.2 VX MT,Delhi,2013,33746,First,185.0,1198.0,868.0,5.0,3.20,0,1,1,3067.818182
5839,6011,Skoda Superb 3.6 V6 FSI,Hyderabad,2009,53000,First,0.0,3597.0,2626.0,5.0,4.75,0,1,0,3533.333333
5845,6017,Maruti Wagon R VXI,Kolkata,2013,46000,First,189.0,998.0,671.0,5.0,2.65,0,1,1,4181.818182

In [445]:
rename = dataset.rename(columns={'Kilometers_Driven': 'KM_Driven', 'Price': 'Car_Price'})
rename

,Unnamed: 0,Name,Location,Year,KM_Driven,Owner_Type,Mileage,Engine,Power,Seats,Car_Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,First,1967.0,1582.0,1262.0,5.0,12.50,0,0,1,4555.555556
1,2,Honda Jazz V,Chennai,2011,46000,First,13.0,1199.0,887.0,5.0,4.50,0,1,1,3538.461538
2,3,Maruti Ertiga VDI,Chennai,2012,87000,First,2077.0,1248.0,8876.0,7.0,6.00,0,0,1,7250.000000
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Second,152.0,1968.0,1408.0,5.0,17.74,0,0,0,3697.272727
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,First,2308.0,1461.0,631.0,5.0,3.50,0,0,1,7909.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5842,6014,Maruti Swift VDI,Delhi,2014,27365,First,284.0,1248.0,74.0,5.0,4.75,0,0,1,2736.500000
5843,6015,Hyundai Xcent 1.1 CRDi S,Jaipur,2015,100000,First,244.0,1120.0,71.0,5.0,4.00,0,0,1,11111.111111
5844,6016,Mahindra Xylo D4 BSIV,Jaipur,2012,55000,Second,140.0,2498.0,112.0,8.0,2.90,0,0,1,4583.333333
5845,6017,Maruti Wagon R VXI,Kolkata,2013,46000,First,189.0,998.0,671.0,5.0,2.65,0,1,1,4181.818182
5846,6018,Chevrolet Beat Diesel,Hyderabad,2011,47000,First,2544.0,936.0,576.0,5.0,2.50,0,0,1,3615.384615

In [446]:
dataset['Mileage_Kmpl'] = dataset['Mileage'].apply(extract_numeric)
dataset['Engine_CC'] = dataset['Engine'].apply(extract_numeric).astype(float)  
dataset['Engine_CC'] = dataset['Engine_CC'].fillna(0).astype(int)  
dataset['Power_BHP'] = dataset['Power'].apply(extract_numeric)
dataset

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year,Mileage_Kmpl,Engine_CC,Power_BHP
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,First,1967.0,1582.0,1262.0,5.0,12.50,0,0,1,4555.555556,NaN,0,NaN
1,2,Honda Jazz V,Chennai,2011,46000,First,13.0,1199.0,887.0,5.0,4.50,0,1,1,3538.461538,NaN,0,NaN
2,3,Maruti Ertiga VDI,Chennai,2012,87000,First,2077.0,1248.0,8876.0,7.0,6.00,0,0,1,7250.000000,NaN,0,NaN
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Second,152.0,1968.0,1408.0,5.0,17.74,0,0,0,3697.272727,NaN,0,NaN
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,First,2308.0,1461.0,631.0,5.0,3.50,0,0,1,7909.000000,NaN,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5842,6014,Maruti Swift VDI,Delhi,2014,27365,First,284.0,1248.0,74.0,5.0,4.75,0,0,1,2736.500000,NaN,0,NaN
5843,6015,Hyundai Xcent 1.1 CRDi S,Jaipur,2015,100000,First,244.0,1120.0,71.0,5.0,4.00,0,0,1,11111.111111,NaN,0,NaN
5844,6016,Mahindra Xylo D4 BSIV,Jaipur,2012,55000,Second,140.0,2498.0,112.0,8.0,2.90,0,0,1,4583.333333,NaN,0,NaN
5845,6017,Maruti Wagon R VXI,Kolkata,2013,46000,First,189.0,998.0,671.0,5.0,2.65,0,1,1,4181.818182,NaN,0,NaN
5846,6018,Chevrolet Beat Diesel,Hyderabad,2011,47000,First,2544.0,936.0,576.0,5.0,2.50,0,0,1,3615.384615,NaN,0,NaN

In [447]:
arranging_data = dataset.sort_values(by='Year', ascending=True)
arranging_data

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year,Mileage_Kmpl,Engine_CC,Power_BHP
5558,5716,Maruti Zen LX,Jaipur,1998,95150,Third,173.0,993.0,60.0,5.0,0.53,0,1,1,3659.615385,NaN,0,NaN
3039,3138,Maruti Zen LXI,Jaipur,1998,95150,Third,173.0,993.0,60.0,5.0,0.45,0,1,1,3659.615385,NaN,0,NaN
3630,3749,Mercedes-Benz E-Class 250 D W 210,Mumbai,1998,55300,First,100.0,1796.0,1577.0,5.0,3.90,0,0,0,2126.923077,NaN,0,NaN
1791,1845,Honda City 1.3 EXI,Pune,1999,140000,First,130.0,1343.0,90.0,5.0,0.90,0,1,1,5600.000000,NaN,0,NaN
1185,1224,Maruti Zen VX,Jaipur,1999,70000,Second,173.0,993.0,60.0,5.0,0.77,0,1,1,2800.000000,NaN,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4956,5102,Maruti Wagon R VXI,Kochi,2019,31817,First,225.0,998.0,6704.0,5.0,5.34,0,1,1,6363.400000,NaN,0,NaN
5712,5875,Mercedes-Benz C-Class Progressive C 220d,Ahmedabad,2019,4000,First,0.0,1950.0,194.0,5.0,35.00,0,0,0,800.000000,NaN,0,NaN
1486,1534,Honda City i VTEC VX Option,Coimbatore,2019,23882,First,174.0,1497.0,1173.0,5.0,11.87,0,1,1,4776.400000,NaN,0,NaN
4319,4452,Toyota Innova Crysta 2.8 GX AT,Kochi,2019,14076,First,1136.0,2755.0,1715.0,7.0,19.40,0,0,0,2815.200000,NaN,0,NaN
2511,2595,Tata Tiago AMT 1.2 Revotron XZA,Coimbatore,2019,15379,First,2384.0,1199.0,8383.0,5.0,6.97,0,1,0,3075.800000,NaN,0,NaN

In [448]:
summary= dataset.describe()
summary

,Unnamed: 0,Year,Kilometers_Driven,Mileage,Engine,Power,Seats,Price,Fuel_Type_Electric,Fuel_Type_Petrol,Transmission_Manual,Kilometers_Per_Year,Mileage_Kmpl,Engine_CC,Power_BHP
count,5847.000000,5847.000000,5.847000e+03,5847.000000,5847.000000,5847.000000,5847.000000,5847.000000,5847.000000,5847.000000,5847.000000,5847.000000,0.0,5847.0,0.0
mean,3013.181461,2013.448435,5.841013e+04,863.146108,1631.552573,2736.719670,5.286452,9.653742,0.000342,0.459039,0.707200,5555.018281,NaN,0.0,NaN
std,1736.398890,3.194949,9.237971e+04,854.460932,600.116234,5012.122216,0.804042,11.275966,0.018493,0.498362,0.455086,12494.284722,NaN,0.0,NaN
min,1.000000,1998.000000,1.710000e+02,0.000000,72.000000,35.000000,2.000000,0.440000,0.000000,0.000000,0.000000,34.200000,NaN,0.0,NaN
25%,1509.500000,2012.000000,3.346750e+04,174.000000,1198.000000,140.000000,5.000000,3.550000,0.000000,0.000000,0.000000,3500.038462,NaN,0.0,NaN
50%,3015.000000,2014.000000,5.257600e+04,231.000000,1497.000000,838.000000,5.000000,5.750000,0.000000,0.000000,1.000000,5000.000000,NaN,0.0,NaN
75%,4517.500000,2016.000000,7.249050e+04,1701.000000,1991.000000,1715.000000,5.000000,10.250000,0.000000,1.000000,1.000000,6666.666667,NaN,0.0,NaN
max,6018.000000,2019.000000,6.500000e+06,2809.000000,5998.000000,108495.000000,10.000000,160.000000,1.000000,1.000000,1.000000,928571.428571,NaN,0.0,NaN

In [449]:
grouping_data = dataset.groupby('Location').agg({'Price': 'mean', 'Kilometers_Driven': 'sum'})
grouping_data

                Price  Kilometers_Driven
Location
Ahmedabad    8.567248           11984485
Bangalore   13.482670           20496207
Chennai      7.958340           43075555
Coimbatore  15.160206           29625311
Delhi        9.881944           30880339
Hyderabad    9.997423           50162673
Jaipur       5.916725           28658786
Kochi       11.309109           28619518
Kolkata      5.733924           22812326
Mumbai       9.592546           34035614
Pune         6.951000           41173243